// lib/data.dart

const Map<String, List<String>> governmentToCities = {

    'القاهرة': [
      'مدينة بدر',
      'السلام',
      'مارج',
      'المطرية',
      'عين شمس',
      'مصر الجديدة',
      'الزيتون',
      'شبرا',
      'حلوان',
      'الشروق',
      'الشرابية',
      'النزهة',
      'مدينة نصر',
      'الزمالك',
      'حدائق القبة'
    ],
    'الجيزة': [
      'العجوزة',
      'إمبابة',
      'الدقي',
      'أوسيم',
      'كرداسة',
      'مركز الجيزة',
      '6 أكتوبر',
      'أوسيم',
      'الطالبية',
      'الشيخ زايد'
    ],
    'الإسكندرية': [
      'العامرية',
      'المنتزه',
      'الجمرك',
      'برج العرب',
      'الساحل الشمالي',
      'الرمل',
      'الدخيلة',
      'كرموز',
      'محرم بك',
      'سيدي جابر',
      'الدخيلة',
      'المنشية'
    ],
    'الدقهلية': [
      'أجا',
      'طلخا',
      'شربين',
      'دكرنس',
      'السنبلاوين',
      'جمصة',
      'ميت غمر',
      'بني عبيد',
      'المنصورة',
      'محلة دمنة',
      'المنزلة'
    ],
    'المنوفية': [
      'شبين الكوم',
      'قويسنا',
      'منوف',
      'بركة السبع',
      'تلا',
      'سرس الليان',
      'مدينة السادات',
      'الشهداء',
      'أشمون'
    ],
    'الشرقية': [
      'أبو حماد',
      'الإبراهيمية',
      'الصالحية',
      'بلبيس',
      'فاقوس',
      'الزقازيق',
      'القرين',
      'القنايات',
      'الصالحية الجديدة',
      'الحسينية',
      'بلبيس',
      'فاقوس',
      'ههيا',
      'منيا القمح',
      'مشتول السوق'
    ],
    'الغربية': [
      'السنطة',
      'بسيون',
      'قطور',
      'طنطا',
      'كفر الزيات',
      'زفتى',
      'المحلة الكبرى',
      'سمنود'
    ],
    'المنيا': [
      'أبو قرقاص',
      'المنيا',
      'مغاغة',
      'ملوي',
      'مطاي',
      'سمالوط',
      'المنيا الجديدة',
      'دير مواس',
      'بني مزار',
      'العدوة'
    ],
    'أسيوط': [
      'صدفا',
      'ساحل سليم',
      'ديروط',
      'القوصية',
      'الفتح',
      'الغنايم',
      'أسيوط',
      'أبو تيج',
      'البداري'
    ],
    'سوهاج': [
      'أخميم',
      'المراغة',
      'جرجا',
      'جهينة',
      'سوهاج',
      'البلينا',
      'المنشاة',
      'العسيرات',
      'سوهاج'
    ],
    'قنا': [
      'فرشوط',
      'نجع حمادي',
      'نقادة',
      'قوص',
      'قفط',
      'أبو تشت',
      'دشنا',
      'الوقف',
      'قنا'
    ],
    'البحيرة': [
      'أبو حمص',
      'أبو المطامير',
      'الدلنجات',
      'الرحمانية',
      'المحمودية',
      'كفر الدوار',
      'دمنهور',
      'شبراخيت',
      'وادي النطرون'
    ],
    'بني سويف': [
      'سمسطا',
      'الواسطى',
      'إهناسيا',
      'الفشن',
      'بني سويف',
      'ببا',
      'ناصر'
    ],
    'دمياط': [
      'دمياط',
      'كفر سعد',
      'الزرقا',
      'السرو',
      'فارسكور',
      'رأس البر',
      'كفر البطيخ',
      'الزرقا'
    ],
    'كفر الشيخ': [
      'مطوبس',
      'كفر الشيخ',
      'دسوق',
      'سيدي سالم',
      'الرياض',
      'بلطيم',
      'الحمول',
      'فوه',
      'قلين',
      'بيلا'
    ],
    'الفيوم': [
      'إبشواي',
      'سنورس',
      'دسوق',
      'طامية',
      'شواشنه',
      'الفيوم',
      'يوسف الصديق',
      'إطسا'
    ],
    'القليوبية': [
      'قليوب',
      'بنها',
      'الخانكة',
      'الخصوص',
      'بنها',
      'شبرا الخيمة',
      'طوخ',
      'قها',
      'العبور'
    ],
    'أسوان': [
      'إدفو',
      'كوم أمبو',
      'أبو سمبل',
      'دراو',
      'نصر',
      'توشكى الجديدة',
      'أسوان'
    ],
    'الأقصر': [
      'إسنا',
      'القرنة',
      'أرمنت',
      'طيبة'
    ],
    'الإسماعيلية': [
      'التل الكبير',
      'القصاصين',
      'فايد',
      'أبو صوير',
      'القنطرة غرب',
      'القنطرة شرق',
      'أبو صوير'
    ]



  // Add more governments and cities here
};
